_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ЗагрузкаРесурсовИзФГИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_ЗагрузкаРесурсовИзФГИС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаМашинистов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиныИМеханизмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ГодыВыпускаБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ГодыВыпускаБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>г1984</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г1991</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г2001</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г2009</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>г2017</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_Ресурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ГодыВыпускаБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКДП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьСтоимостьНаОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ЗагрузкаРесурсовИзФГИС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьКлассификатор(Команда)
	
	РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла 								= Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.Фильтр                      	= НСтр("ru='Книга Excel 2007 (*.xlsx)|*.xlsx'");
	ДиалогВыбораФайла.Заголовок                   	= Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     	= Ложь;
	ДиалогВыбораФайла.Расширение                  	= "xlsx";
	ДиалогВыбораФайла.ИндексФильтра               	= 0;
	
	// Синхронный вызов
	//Если ДиалогВыбораФайла.Выбрать() Тогда
	//	Если ЗначениеЗаполнено(ДиалогВыбораФайла.ПолноеИмяФайла) Тогда
	//		ТекПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	//		ЗагрузитьИзЭксельНаСервере(ТекПутьКФайлу);
	//	КонецЕсли;
	//КонецЕсли;
	
	// Замена на асинхронный вызов
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект);
	ДиалогВыбораФайла.Показать(ОповещениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайла(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			ЗагрузитьИзЭксельНаСервере(ТекЭлемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьИзЭксельНаСервере(ИмяФайла)
	
    Попытка
    	КнигаЭксель = ПолучитьCOMОбъект(ИмяФайла);
    Исключение
    	Возврат;
    КонецПопытки;

    ExcelЛист 			= КнигаЭксель.Sheets.Item(1);
   // RowCount 			= ExcelЛист.UsedRange.Rows.Count; 		// Кол-во строк
   // ColumnCount 		= ExcelЛист.UsedRange.Columns.Count; 	// Кол-во колонок
    КоличествоЛистов 	= КнигаЭксель.Sheets.Count; 			// Количество листов
    
	Для Сч = 1 По КоличествоЛистов Цикл

		ExcelЛист 		= КнигаЭксель.Sheets.Item(Сч);
		ИмяЛиста 		= СокрЛП(ExcelЛист.name);
		КоличествоСтрок = ExcelЛист.UsedRange.Rows.Count;

		Если ИмяЛиста = "Материалы" Тогда
			ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы;
		ИначеЕсли ИмяЛиста = "Оборудование" Тогда
			ВидРесурса = Перечисления.СМ_ВидыРесурсов.Оборудование;
		ИначеЕсли ИмяЛиста = "Машины и механизмы" Тогда
			ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы;
		Иначе
			Возврат;
		КонецЕсли;

		ЗагрузитьРесурсыЛиста(ExcelЛист,КоличествоСтрок,ВидРесурса);

	КонецЦикла;
    
	Сообщение 		= Новый СообщениеПользователю();
	Сообщение.Текст = "Обработка данных завершена!";
	Сообщение.Сообщить();	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРесурсыЛиста(ExcelЛист,КоличествоСтрок,ВидРесурса)
	
	ГруппаПоУмолчанию = Справочники.СМ_Ресурсы.Каталог2017;
	
	Для СтрокаЗагрузки = 3 По КоличествоСтрок Цикл
		
		КодРесурса		 	= ExcelЛист.Cells(СтрокаЗагрузки,1).Text;
		Наименование 		= ExcelЛист.Cells(СтрокаЗагрузки,2).Text;
		ЕдиницаИзмерения	= СокрЛП(ExcelЛист.Cells(СтрокаЗагрузки,3).Text);
		
		Если НЕ ЗначениеЗаполнено(КодРесурса) И НЕ ЗначениеЗаполнено(Наименование) И НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			Прервать;
		КонецЕсли;
	
		Если КодРесурса = Наименование Тогда
			ТекущаяГруппа = НайтиСоздатьГруппу(Наименование,ГруппаПоУмолчанию);
		Иначе
			НайтиСоздатьРесурс(КодРесурса, Наименование, ЕдиницаИзмерения, ВидРесурса, ТекущаяГруппа);
		КонецЕсли;
	
	КонецЦикла;		
	
   Сообщение 		= Новый СообщениеПользователю();
   Сообщение.Текст 	= "Загружены ресурсы вида " + ВидРесурса;
   Сообщение.Сообщить();	
	
КонецПроцедуры
	
&НаСервере
Функция НайтиСоздатьГруппу(НаименованиеГруппы, ГруппаПоУмолчанию)
	
	МассивГруппы 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НаименованиеГруппы,":",,Истина);
	СтрокаКода          = МассивГруппы[0];
	СтрокаНаименования  = МассивГруппы[1];

	МассивКода 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаКода," ",,Истина);
	КодГруппы 			= МассивКода[1];
	ТекПозиция 			= СтрНайти(КодГруппы,".",НаправлениеПоиска.СКонца);
	КодГруппыРодителя 	= Лев(КодГруппы,ТекПозиция-1);

	Если ЗначениеЗаполнено(КодГруппыРодителя) Тогда
		ГруппаРодитель = Справочники.СМ_Ресурсы.НайтиПоКоду(КодГруппыРодителя);	
	Иначе
		ГруппаРодитель = ГруппаПоУмолчанию;
	КонецЕсли;

	НайденнаяГруппа = Справочники.СМ_Ресурсы.НайтиПоКоду(КодГруппы,,ГруппаРодитель);
	Если НайденнаяГруппа = Справочники.СМ_Ресурсы.ПустаяСсылка() Тогда
		НоваяГруппа 					= Справочники.СМ_Ресурсы.СоздатьГруппу();
		НоваяГруппа.Код                 = КодГруппы;
		НоваяГруппа.Наименование        = СтрокаНаименования;
		НоваяГруппа.ДлинноеНаименование	= НаименованиеГруппы;
		НоваяГруппа.Родитель			= ГруппаРодитель;
		Попытка 
			НоваяГруппа.Записать();
		Исключение                                                                            
			Сообщение 		= Новый СообщениеПользователю();
			Сообщение.Текст = "Не удалось записать группу: " + НоваяГруппа;
			Сообщение.Сообщить();				
		КонецПопытки;
		НайденнаяГруппа = НоваяГруппа.Ссылка;
	КонецЕсли;

	Возврат НайденнаяГруппа;
	
КонецФункции

&НаСервере
Процедура НайтиСоздатьРесурс(КодРесурсаСтр,Наименование, ЕдиницаИзмеренияСтр, ВидРесурса, ТекущаяГруппа)
	
	КодГруппы		= ТекущаяГруппа.Код;
	ДлинаКода		= СтрДлина(КодРесурсаСтр);
	ТекПозиция		= СтрНайти(КодРесурсаСтр,КодГруппы);
	КодРесурса		= Сред(КодРесурсаСтр,ТекПозиция);
	КодОКПД2		= Лев(КодРесурсаСтр,ТекПозиция-2);
		
	НайденныйРесурс = Справочники.СМ_Ресурсы.НайтиПоКоду(КодРесурса,Ложь,ТекущаяГруппа);
	Если НайденныйРесурс = Справочники.СМ_Ресурсы.ПустаяСсылка() Тогда
		ТекРесурс 						= Справочники.СМ_Ресурсы.СоздатьЭлемент();
		ТекРесурс.Код                   = КодРесурса;
		ТекРесурс.Наименование          = Наименование;
		ТекРесурс.ДлинноеНаименование   = Наименование;
		ТекРесурс.КодОКДП2              = КодОКПД2;
		ТекРесурс.ВидРесурса            = ВидРесурса;
		ТекРесурс.ГруппаРесурсов		= Справочники.СМ_ГруппыРесурсов.Каталог2017;
		ТекРесурс.ГодВыпуска			= Перечисления.СМ_ГодыВыпускаБазы.г2017;
		ТекРесурс.Родитель				= ТекущаяГруппа;
		ТекЕдиницаИзмерения 			= НайтиСоздатьЕдиницуИзмерения(ЕдиницаИзмеренияСтр);
		ТекРесурс.ЕдиницаИзмерения 		= ТекЕдиницаИзмерения;
		Попытка 
			ТекРесурс.Записать();
		Исключение
			Сообщение 		= Новый СообщениеПользователю();
			Сообщение.Текст = "Не удалось записать ресурс: " + ТекРесурс;
			Сообщение.Сообщить();			
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиСоздатьЕдиницуИзмерения(ЕдиницаИзмеренияСтр)
	
	ТекЕдиницаИзмерения = СМ_СметаВызовСервера.НайтиЕдиницуИзмеренияПоСтроке(ЕдиницаИзмеренияСтр);
	Если ТекЕдиницаИзмерения.Пустая() Тогда
		Если ЕдиницаИзмеренияСтр = "шт." Тогда
			ТекЕдиницаИзмерения = СМ_СметаВызовСервера.НайтиЕдиницуИзмеренияПоСтроке("шт");
		КонецЕсли;
	КонецЕсли;

	Если ТекЕдиницаИзмерения.Пустая() Тогда
  		ЕдиницаИзмерения 						= Справочники.СМ_ЕдиницыИзмеренияСмета.СоздатьЭлемент();
		ЕдиницаИзмерения.Наименование 			= ЕдиницаИзмеренияСтр;
		ЕдиницаИзмерения.ОбменДанными.Загрузка 	= Истина;
		ЕдиницаИзмерения.Записать();
		ТекЕдиницаИзмерения = ЕдиницаИзмерения.Ссылка;
	КонецЕсли;
	
	Возврат ТекЕдиницаИзмерения;
	
КонецФункции

#КонецОбласти
